Revit 2026 API

# BoundaryConditionsPoint Property

---

Returns the position of point boundary conditions.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Point { get; }
```
```vb
Public ReadOnly Property Point As XYZ
	Get
```
```cpp
public:
property XYZ^ Point {
	XYZ^ get ();
}
```
```fsharp
member Point : XYZ with get
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidObjectException | Thrown when BoundaryConditions is not a BoundaryConditionsType::Point type. |

Boundary conditions should be BoundaryConditionsType::Point type. Otherwise exception is thrown.

#### Reference

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace